app/views/articles/_article.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = $1  [["article_id", 5]]
---
        <% if @article != nil %>
            <% @article.comments.each do |message| %>